bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <FS.h>
#include <LittleFS.h>
#include <HTTPClient.h>
#include <ESP32Ping.h>
#include <mbedtls/base64.h>
#include <BLEDevice.h>
#include <BLESecurity.h>
#include <BLEUtils.h>

#include "config.hpp"

bool isNtfyConfigured() {
  return strlen(NTFY_TOPIC) > 0;
}

bool isDiscordConfigured() {
  return strlen(DISCORD_WEBHOOK_URL) > 0;
}

bool isSmtpConfigured() {
  return strlen(SMTP_SERVER) > 0 && strlen(SMTP_FROM_ADDRESS) > 0 &&
         strlen(SMTP_TO_ADDRESS) > 0;
}

bool isMeshCoreConfigured() {
  return strlen(BLE_PEER_NAME) > 0;
}

void sendNtfyNotification(const String& title, const String& message, const String& tags = "warning,monitor");
void sendDiscordNotification(const String& title, const String& message);
void sendSmtpNotification(const String& title, const String& message);
void sendMeshCoreNotification(const String& title, const String& message);
void scanBLEDevices();
void initBLE();
bool connectToMeshCore();
void disconnectFromMeshCore();
void disconnectWiFi();
void reconnectWiFi();
bool ensureMeshChannel();
bool provisionMeshChannel();

AsyncWebServer server(80);

// BLE / MeshCore
BLEClient* meshClient = nullptr;
BLERemoteCharacteristic* meshTxCharacteristic = nullptr;  // ESP32 writes to this (TX to device)
BLERemoteCharacteristic* meshRxCharacteristic = nullptr;  // ESP32 reads from this (RX from device)
bool meshDeviceConnected = false;
unsigned long lastMeshConnectAttempt = 0;
String lastMeshError = "";
bool meshChannelReady = false;
const int BLE_MTU_NEGOTIATION_DELAY_MS = 2000;
const int BLE_SERVICE_DISCOVERY_RETRIES = 5;
const int BLE_SERVICE_DISCOVERY_RETRY_DELAY_MS = 1000;
const int BLE_DEINIT_CLEANUP_DELAY_MS = 100; // Allow BLE stack to complete cleanup before deinit
const int BLE_CLIENT_CLEANUP_DELAY_MS = 100; // Allow BLE stack to complete cleanup when recreating client
const int BLE_NOTIFY_REGISTRATION_DELAY_MS = 500; // Allow CCCD write to complete after registering for notifications

// BLE/WiFi coexistence - ESP32-S3 cannot run WiFi and BLE simultaneously
bool bleOperationInProgress = false;
bool monitoringPaused = false;
bool bleInitialized = false;

// MeshCore protocol state
enum MeshCoreState {
  MESH_STATE_DISCONNECTED = 0,
  MESH_STATE_CONNECTED,
  MESH_STATE_NEGOTIATED,  // After CMD_DEVICE_QUERY
  MESH_STATE_READY        // After CMD_APP_START
};
MeshCoreState meshProtocolState = MESH_STATE_DISCONNECTED;
uint8_t meshProtocolVersion = 3;  // Target protocol version
uint8_t meshChannelIndex = 0;     // Channel index for sending messages

// Nordic UART Service UUIDs (used by MeshCore BLE companion firmware)
const char* NUS_SERVICE_UUID = "6e400001-b5a3-f393-e0a9-e50e24dcca9e";
const char* NUS_TX_CHAR_UUID = "6e400002-b5a3-f393-e0a9-e50e24dcca9e";  // Write to this
const char* NUS_RX_CHAR_UUID = "6e400003-b5a3-f393-e0a9-e50e24dcca9e";  // Notifications from this

// MeshCore Companion Radio Protocol Commands
const uint8_t CMD_APP_START = 1;
const uint8_t CMD_SEND_CHANNEL_TXT_MSG = 3;
const uint8_t CMD_GET_CHANNEL = 31;   // 0x1F
const uint8_t CMD_SET_CHANNEL = 32;   // 0x20
const uint8_t CMD_DEVICE_QUERY = 22;  // 0x16

// MeshCore Protocol Response Codes
const uint8_t RESP_CODE_OK = 0;
const uint8_t RESP_CODE_ERR = 1;
const uint8_t RESP_CODE_SELF_INFO = 5;
const uint8_t RESP_CODE_SENT = 6;
const uint8_t RESP_CODE_DEVICE_INFO = 13;
const uint8_t RESP_CODE_CHANNEL_INFO = 18;

// MeshCore Protocol Error Codes
const uint8_t ERR_CODE_NOT_FOUND = 2;

// Maximum frame payload size (MeshCore limit is 172 bytes, BLE MTU is typically 185-512 after negotiation)
const uint16_t MAX_FRAME_PAYLOAD = 172;

// Note: For BLE, frames are sent/received as raw payloads - no framing markers needed.
// The USB protocol uses '<' and '>' markers with length prefix, but BLE doesn't need this
// because each BLE characteristic write/notification is a complete frame.

// MeshCore channel configuration sizes
const size_t MESH_CHANNEL_NAME_SIZE = 32;
const size_t MESH_CHANNEL_KEY_SIZE = 16;

// Reserved bytes in CMD_APP_START
const size_t APP_START_RESERVED_SIZE = 6;

// Maximum text message length (conservative for LoRa payload)
const size_t MAX_TEXT_MESSAGE_LEN = 140;

// RX buffer for storing received BLE notification payload
const int MESH_RX_BUFFER_SIZE = 256;
uint8_t meshRxBuffer[MESH_RX_BUFFER_SIZE];
int meshRxPayloadLen = 0;  // Length of current payload in buffer
volatile bool meshResponseReceived = false;
uint8_t meshLastResponseCode = 0xFF;

class MeshClientCallbacks : public BLEClientCallbacks {
  void onConnect(BLEClient* client) override {
    meshDeviceConnected = true;
    lastMeshError = "";
  }

  void onDisconnect(BLEClient* client) override {
    meshDeviceConnected = false;
    meshChannelReady = false;
    meshProtocolState = MESH_STATE_DISCONNECTED;
  }
};

// Static callback instance to avoid memory leak from repeated allocations
static MeshClientCallbacks meshClientCallbacks;

// Notification callback for receiving data from MeshCore device
// For BLE: each notification is a complete frame (no framing markers needed)
// The first byte of the payload is the response/push code
void meshNotifyCallback(BLERemoteCharacteristic* pCharacteristic, uint8_t* pData, size_t length, bool isNotify) {
  // For BLE, each notification is a complete frame - no accumulation needed
  // The BLE link layer ensures frame integrity
  
  if (length == 0) {
    Serial.println("MeshCore RX: empty notification received");
    return;
  }
  
  // Reject oversized payloads to prevent buffer overflow and data corruption
  if (length > MESH_RX_BUFFER_SIZE) {
    Serial.printf("MeshCore RX: payload too large (%d > %d), rejecting frame\n", 
                  (int)length, MESH_RX_BUFFER_SIZE);
    meshRxPayloadLen = 0;
    meshResponseReceived = false;
    return;
  }
  
  // First byte is the response code
  meshLastResponseCode = pData[0];
  Serial.printf("MeshCore RX: response code 0x%02X, length %d\n", meshLastResponseCode, (int)length);
  
  // Store the complete payload in the buffer for any code that might need to parse additional data
  memcpy(meshRxBuffer, pData, length);
  meshRxPayloadLen = length;
  
  meshResponseReceived = true;
}

// Send a frame to the MeshCore device
// For BLE: frames are sent as raw payload (no framing needed - BLE handles integrity)
// For USB: frames would need '<' + len_lo + len_hi + payload framing (not used here)
bool sendMeshFrame(const uint8_t* payload, size_t payloadLen) {
  if (!meshDeviceConnected || meshTxCharacteristic == nullptr || meshProtocolState < MESH_STATE_CONNECTED) {
    return false;
  }
  
  // Validate payload length
  if (payloadLen > MAX_FRAME_PAYLOAD) {
    Serial.printf("MeshCore TX: payload too large (%d > %d)\n", (int)payloadLen, MAX_FRAME_PAYLOAD);
    return false;
  }
  
